function [st_ll,d,uu]=ECG250(ecg,fs)
%% 该函数实现了R波峰值点的检测，函数主要分为了以下几个模块
%%1.对ECG数据进行预处理，便于求取R波峰值点，而预处理过程大体分为以下5个步骤
%对原始ECG进行归一化和去线性趋势处理，设计FIR滤波器进行滤波，对滤波后的数据进行求导
%对求导之后的数据取绝对值，对取绝对值之后的数据进行80ms的移动平均

%%2.对预处理之后的数据求R波峰值点。通过一个函数detectionRR实现对R波峰值点的检测。
%对于正常的ECG则直接使用检测之后的结果，因为detectionRR函数对R波峰值点的检测是自适应的，
%它会自适应调整阈值和最小峰值，所有可能会使得对同一组ECG数据
%的多次检测结果不同，有可能第一个漏检几个点，而第二次就可以检测到。

%%3.寻找原始ECG的峰值点位置
%预处理后的ECG找到的R波峰值点对比原始ECG数据的R波峰值点，一般延迟在30个采样点之内
%所有我们在预处理后的ECG找到的R波峰值点位置的基础上，在原始ECG上找其前面30个点的最大值
%该最大值即为对应的原始ECG的R波峰值点位置
%% ECG数据预处理%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
p=ecg;
tr=length(p);
%归一化、去线性趋势
lo=(p-mean(p))/std(p);%数据归一化 x                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    
uu=detrend(lo);%数据去线性趋势
%设计FIR带通滤波器
fc1=5;%通带下限截止频率5hz
fc2=26;%通带上限截止频率26hz
b=fir1(60,[2*fc1/fs,2*fc2/fs]);%设置FIR滤波器，阶数设为60
SF=filter(b,1,uu);%使用该滤波器进行滤波
SF=SF';
%得到滤波后信号的导数
t=1:1:tr;
a=diff(SF)./diff(t);%求导，R波斜率大，突出R波
c=abs(a);%求绝对值
for hh=1:tr-20*4
    as(hh)=mean(c(hh:hh+(20*4)-1));%求80ms内平均值，移动类推
end
% as=as(101:end);
% % % % % % % % % % % % % % % % % % % % % % % % % % % % % % 

%% 寻找预处理后的数据的R波峰值点
o_as=as/max(as);%将预处理后的心电数据进行归一化
% [heartRate,peak,threshold,MIN_PEAK_AMP]  = detectionRR2(o_as);%对归一化的ECG求R波峰值点
 [heartRate,peak,threshold]  = detectionRR2(o_as,fs);%对归一化的ECG求R波峰值点
pk=find(peak~=0);%找出R波峰值点所在位置和个数
    %% 如果对未分段前的数据进行R波峰值检测之后，R波峰值点个数大于25，则认为没有出现异常情况，不用进行分段处理
    %可以直接对检测到的R波峰值点进行处理，减去延时对应道预处理之后的ECG上
    pk=pk-60;
    for i=1:1:length(pk)
        if pk(i)<=0
            pk(i)=0;
        end
    end
    p_ll=find(pk~=0);
    pk=pk(p_ll(1):end);
    st_ll=pk;
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%寻找预处理后的ECG的R波峰值点%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%% 寻找原始ECG信号的峰值点位置
%预处理后的ECG找到的R波峰值点对比原始ECG数据的R波峰值点，一般延迟在30个采样点之内
%所有我们在预处理后的ECG找到的R波峰值点位置的基础上，在原始ECG上找其前面30个点的最大值
%该最大值即为对应的原始ECG的R波峰值点位置
% p=p(101:end);%因为预处理后的ECG前面总是存在一个较大峰值点导致后面无法检测，删除了前面100个点，所有原始ECG也删除前面100个点
l_ll=length(st_ll);%获取R波峰值点的个数
for i=1:1:l_ll
    if st_ll(i)-50>0
       % pp(:,i)=p(ll(i)-20:ll(i));
        pp=p(st_ll(i)-50:st_ll(i));%获取当前R波峰值点位置的前面30个数据
        m=st_ll(i)-50;
    else
        pp=p(1:st_ll(i));
        m=1;
    end
    RRpeak=max(pp);%获取数据中最大值
    for n=m:1:st_ll(i)
        if pp(n-m+1)==RRpeak%寻找着30个数据中等于最大值的点，即为R波峰值点
            d(i)=n;%获取当前R波峰值点位置
        end
    end
end
%%%%%去除ECG信号错误的峰值点%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
d(uu(d)<mean(uu(d))*0.5)=[];  % 对ECG峰值点位置取平均值，若某一点高度小于平均值的50%，则认为该点判断错误并进行剔除
end